-- [notice]
--일반글
insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '흙당근마켓 이벤트', '오픈기념 10% 자동 할인 이벤트', sysdate,0,0);
insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '포인트 10%추가 지급 이벤트', '오픈기념 10% 자동 할인 이벤트', sysdate,0,0);
insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '흙당근마켓 홈페이지 서버점검 안내', '오픈기념 10% 자동 할인 이벤트', sysdate,0,0);
insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '흙당근마켓 긴급 서버점검 안내', '긴급 서버 점검', sysdate,0,0);
insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '당근마켓에서 지켜야 할 매너-[기본 매너]', '당근마켓에서 따뜻한 경험을 함께 나눠요.
여러분의 작은 친절이 당근 이웃에게 큰 감동을 줄 수 있어요. 당근마켓의 모든 사용자가 우리 동네의 이웃이라는 점을 기억해주세요.
여러분 근처의 이웃에게 따뜻한 배려를 베풀어 주세요.

[기본 매너]
기본적으로 지켜야 하는 매너에는 무엇이 있을까요?
• 서로 존중해요. 우리 존댓말로 대화해요.
• 모두의 시간은 소중합니다. 시간 약속을 꼭 지켜주세요.
• 절대로 중간에 연락 끊기는 일이 없도록 해요. (잠수는 절대 안 돼요!)
• 따뜻한 감사 인사로 마무리를 지어요.
• 어떤 상황에서도 욕설, 비방, 명예훼손 등의 언행은 지양해주세요.
• 늦은 시간 채팅은 부담스러울 수 있어요. 특히 새벽 시간에는 채팅을 자제해주세요.
• 택배 거래는 부득이한 경우에만 요청하시고 가능한 한 직거래로 해주세요.
',
sysdate,0,0);

insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '당근마켓에서 지켜야 할 매너-[구매자 매너]', '당근마켓에서 따뜻한 경험을 함께 나눠요.
여러분의 작은 친절이 당근 이웃에게 큰 감동을 줄 수 있어요. 당근마켓의 모든 사용자가 우리 동네의 이웃이라는 점을 기억해주세요.
여러분 근처의 이웃에게 따뜻한 배려를 베풀어 주세요.

[구매자 매너]
이웃의 상품을 구매하는 구매자로서 따뜻함을 나눠주세요.
• 신중하게 고민한 뒤 판매자와 확실하게 거래 약속을 잡아요.
• 질문하기 전에 판매글을 꼼꼼히 읽어 주세요.
• 지나치게 가격을 깎지 말아 주세요. 가격제안 할 수 있는 경우에만 가격제안 해주세요. (정말 구매할 마음이 있을 때만 해주실 거죠?)
• 직거래할 땐 판매자에게 가까운 장소에서 만나요.
• 물건 금액에 맞게 현금을 미리 준비해주세요.
• 무료나눔을 받은 경우 감사 인사로 마무리해주세요.
',
sysdate,0,0);

insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '당근마켓에서 지켜야 할 매너-[판매자 매너
]', '당근마켓에서 따뜻한 경험을 함께 나눠요.
여러분의 작은 친절이 당근 이웃에게 큰 감동을 줄 수 있어요. 당근마켓의 모든 사용자가 우리 동네의 이웃이라는 점을 기억해주세요.
여러분 근처의 이웃에게 따뜻한 배려를 베풀어 주세요.

[판매자 매너]
개인 간의 거래인 만큼 신뢰할 수 있는 매너를 보여주세요.
• 직접 촬영한 사진으로 판매글을 작성해주세요.
• 물품에 대한 설명을 자세하게 써주세요. 특히, 주요 하자에 대한 내용은 꼭 명시해주세요.
• 판매하기 전에 깨끗하게 세탁 또는 관리해주세요.
• 물품의 시세를 알아보고 가격을 정해주세요. 판매확률을 높일 수 있어요.
• 거래 약속이 정해지면 게시글의 상태를 ''예약중''으로 바꿔주세요.
• 예약한 분이 있다면 그분에게 판매해주세요.
',
sysdate,0,0);

insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '당근마켓에서 지켜야 할 매너-[커뮤니티 매너
]', '당근마켓에서 따뜻한 경험을 함께 나눠요.
여러분의 작은 친절이 당근 이웃에게 큰 감동을 줄 수 있어요. 당근마켓의 모든 사용자가 우리 동네의 이웃이라는 점을 기억해주세요.
여러분 근처의 이웃에게 따뜻한 배려를 베풀어 주세요.

[커뮤니티 매너]
따뜻한 동네생활 커뮤니티를 만들기 위한 약속을 지켜주세요.
• 항상 솔직하게 대화해요.
• 서로 배려하며, 약속을 잘 지켜요.
• 이웃들이 잘 이해할 수 있도록 자세하고 정확한 정보를 제공해요.
• 동네생활은 우리 동네 근처 이웃을 위한 공간이에요. 동네생활과 관련된 글을 작성해주세요.
• 광고/홍보 등의 게시글은 광고를 이용해주세요.
• 중고거래는 중고거래 게시판을 이용해주세요.
• 남녀노소 다양한 이웃이 함께하는 공간이에요. 누군가에게 불편할 수 있는 글들은 올리지 않기로 해요.
',
sysdate,0,0);


--고정글
insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '고정 공지 제목', '고정 내용 입니다',sysdate,0,1);
insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '중요한 공지 내용!', '중요한 내용 입니다',sysdate,0,1);
insert into notice values(NOTICE_NOTICE_NO_SEQ.nextval, '꼭 보세요!!', '완전 중요', sysdate,0,1);



select * from notice;

desc notice;
